In [1]:
import pandas as pd
import numpy as np

In [2]:
# We want to merge these two data frames
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
 
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [7]:
pd.merge(employees, departments, on="DeptID") # Inner join , deptid is the joining condition
# If common dept id not found, then mapping will not be performed, in this case, rows will be dropped

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [8]:
pd.merge(employees, departments, on="DeptID", how="left") # left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [9]:
pd.merge(employees, departments, on="DeptID", how="right") # Right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [10]:
pd.merge(employees, departments, on="DeptID", how="outer") # Outer join -> Returns the data that is present in both the 
# tables, irrespective of the fact whether the data is present or not

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [20]:
# Concatinating two data frames - joining them vertically
df1 = {"name":["Alice","Bob"], "score" : [423,634]}
df2 = {"name":["Charlie","David"], "age" : [45,78]}
df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)

In [21]:
df1

    name  score
0  Alice    423
1    Bob    634

In [22]:
df2

      name  age
0  Charlie   45
1    David   78

In [23]:
pd.concat([df1, df2])

      name  score   age
0    Alice  423.0   NaN
1      Bob  634.0   NaN
0  Charlie    NaN  45.0
1    David    NaN  78.0

In [24]:
# The columns of the other data frame will become new columns
pd.concat([df1, df2], axis=1)

    name  score     name  age
0  Alice    423  Charlie   45
1    Bob    634    David   78